cmsis-svd/cmsis-svd/data/Fujitsu/MB9BF12xT.svd
        <!-- REGISTER "FICR" -->
        <register>
          <name>FICR</name>
          <description>Flash Interrupt Control Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HANGIE" -->
            <field>
              <name>HANGIE</name>
              <description>HANG Interrupt Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RDYIE" -->
            <field>
              <name>RDYIE</name>
              <description>RDY Interrupt Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FISR" -->
        <register>
          <name>FISR</name>
          <description>Flash Interrupt Status Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HANGIF" -->
            <field>
              <name>HANGIF</name>
              <description>HANG Interrupt Flag</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RDYIF" -->
            <field>
              <name>RDYIF</name>
              <description>RDY Interrupt Flag</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FICLR" -->
        <register>
          <name>FICLR</name>
          <description>Flash Interrupt Clear Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HANGC" -->
            <field>
              <name>HANGC</name>
              <description>HANG Interrupt Clear </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RDYC" -->
            <field>
              <name>RDYC</name>
              <description>RDY Interrupt Clear</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FSTR1" -->
        <register>
          <name>FSTR1</name>
          <description>Flash Status Register 1</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PGMS" -->
            <field>
              <name>PGMS</name>
              <description>Flash Program Status</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SERS" -->
            <field>
              <name>SERS</name>
              <description>Flash Sector Erase Status</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ESPS" -->
            <field>
              <name>ESPS</name>
              <description>Flash Erase Suspend Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CERS" -->
            <field>
              <name>CERS</name>
              <description>Flash Chip Erase Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "HNG" -->
            <field>
              <name>HNG</name>
              <description>Flash Hang flag</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RDY" -->
            <field>
              <name>RDY</name>
              <description>Flash Rdy</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CRTRMM" -->
        <register>
          <name>CRTRMM</name>
          <description>CR Trimming Data Mirror Register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TTRMM" -->
            <field>
              <name>TTRMM</name>
              <description>CR Temperature Trimming Data Mirror</description>
              <lsb>16</lsb>
              <msb>20</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRMM" -->
            <field>
              <name>TRMM</name>
              <description>CR Trimming Data Mirror</description>
              <lsb>0</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "UNIQUE_ID" -->
    <peripheral>
      <name>UNIQUE_ID</name>
      <description>Unique ID</description>
      <groupName>UNIQUE_ID</groupName>
      <baseAddress>0x40000200</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "UIDR0" -->
        <register>
          <name>UIDR0</name>
          <description>Unique ID Register 0</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFF0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UID27_0" -->
            <field>
              <name>UID27_0</name>
              <description>Unique ID 27 through 0</description>
              <lsb>4</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UIDR1" -->
        <register>
          <name>UIDR1</name>
          <description>Unique ID Register 1</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UID40_28" -->
            <field>
              <name>UID40_28</name>
              <description>Unique ID 40 through 28</description>
              <lsb>0</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
